devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
#define LOAD_U32(buff, offset)  (u32_t)(((u32_t)buff[offset + 0]) | ((u32_t)buff[offset + 1] << 8) | ((u32_t)buff[offset + 2] << 16) | ((u32_t)buff[offset + 3] << 24))
#define LOAD_U16(buff, offset)  (u16_t)(((u16_t)buff[offset + 0]) | ((u16_t)buff[offset + 1] << 8))

#define MBR_GET_BOOT_SIGNATURE(sector)                  LOAD_U16(sector, MBR_BOOT_SIGNATURE_OFFSET)
#define MBR_GET_PARTITION_1_LBA_FIRST_SECTOR(sector)    LOAD_U32(sector, MBR_PARTITION_1_ENTRY_OFFSET + MBR_PARITION_ENTRY_LBA_FIRST_ADDR_OFFSET)
#define MBR_GET_PARTITION_2_LBA_FIRST_SECTOR(sector)    LOAD_U32(sector, MBR_PARTITION_2_ENTRY_OFFSET + MBR_PARITION_ENTRY_LBA_FIRST_ADDR_OFFSET)
#define MBR_GET_PARTITION_3_LBA_FIRST_SECTOR(sector)    LOAD_U32(sector, MBR_PARTITION_3_ENTRY_OFFSET + MBR_PARITION_ENTRY_LBA_FIRST_ADDR_OFFSET)
#define MBR_GET_PARTITION_4_LBA_FIRST_SECTOR(sector)    LOAD_U32(sector, MBR_PARTITION_4_ENTRY_OFFSET + MBR_PARITION_ENTRY_LBA_FIRST_ADDR_OFFSET)
#define MBR_GET_PARTITION_1_NUMBER_OF_SECTORS(sector)   LOAD_U32(sector, MBR_PARTITION_1_ENTRY_OFFSET + MBR_PARITION_ENTRY_NUM_OF_SECTORS_OFFSET)
#define MBR_GET_PARTITION_2_NUMBER_OF_SECTORS(sector)   LOAD_U32(sector, MBR_PARTITION_2_ENTRY_OFFSET + MBR_PARITION_ENTRY_NUM_OF_SECTORS_OFFSET)
#define MBR_GET_PARTITION_3_NUMBER_OF_SECTORS(sector)   LOAD_U32(sector, MBR_PARTITION_3_ENTRY_OFFSET + MBR_PARITION_ENTRY_NUM_OF_SECTORS_OFFSET)
#define MBR_GET_PARTITION_4_NUMBER_OF_SECTORS(sector)   LOAD_U32(sector, MBR_PARTITION_4_ENTRY_OFFSET + MBR_PARITION_ENTRY_NUM_OF_SECTORS_OFFSET)

/*==============================================================================
  Local types, enums definitions
==============================================================================*/
/* partition description */
struct partition {
        mutex_t *file_lock_mtx;
        u32_t    first_sector;
        u32_t    size_in_sectors;
};

/** card types */
typedef u8_t card_type;

/** handling structure */
struct sdspi_data {
        FILE            *gpio_file;
        card_type        card_type;
        bool             card_initialized;
        mutex_t         *card_protect_mtx;
        mutex_t         *file_lock_mtx;
        struct partition partition[4];
#if (SDSPI_ENABLE_DMA != 0)
        task_t          *DMA_host_task;
#endif
};

/*==============================================================================
  Local function prototypes
==============================================================================*/
static stdret_t turn_on_SPI_clock(void);
static stdret_t turn_off_SPI_clock(void);
static u8_t     send_cmd(struct sdspi_data *sdspi, u8_t cmd, u32_t arg);
static u8_t     wait_ready(void);
static u8_t     spi_rw(u8_t out);
static bool     receive_data_block(u8_t *buff);
static bool     transmit_data_block(const u8_t *buff, u8_t token);
static size_t   read_whole_sectors(struct sdspi_data *hdl, void *dst, size_t nsectors, u64_t lseek);
static size_t   read_partial_sectors(struct sdspi_data *hdl, void *dst, size_t size, u64_t lseek);
static size_t   write_whole_sectors(struct sdspi_data *hdl, const void *src, size_t nsectors, u64_t lseek);
static size_t   write_partial_sectors(struct sdspi_data *hdl, const void *src, size_t size, u64_t lseek);
static stdret_t initialize_card(struct sdspi_data *hdl);
static stdret_t detect_partitions(struct sdspi_data *hdl);
static size_t   card_read(struct sdspi_data *hdl, void *dst, size_t size, size_t nitems, u64_t lseek);
static size_t   card_write(struct sdspi_data *hdl, const void *src, size_t size, size_t nitems, u64_t lseek);

/*==============================================================================
  Local object definitions
==============================================================================*/
static struct sdspi_data *sdspi_data;

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out] **drvhdl         driver's memory handler
 * @param[in]  dev              device number
 * @param[in]  part             device part
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t SDSPI_init(void **drvhdl, uint dev, uint part)
{
        struct sdspi_data *sdspi;

        if (dev != SDSPI_DEV_NO || part != SDSPI_DEV_PART || !drvhdl) {
                return STD_RET_ERROR;
        }

        if (!(sdspi = calloc(1, sizeof(struct sdspi_data)))) {
                return STD_RET_ERROR;
        }

        *drvhdl = sdspi;
        sdspi_data = sdspi;

#if (SDSPI_ENABLE_DMA != 0)
        if ((u32_t)SDSPI_DMA == DMA1_BASE) {
                RCC->AHBENR |= RCC_AHBENR_DMA1EN;
        } else if ((u32_t)SDSPI_DMA == DMA2_BASE) {
                RCC->AHBENR |= RCC_AHBENR_DMA2EN;
        }
#endif

        if (!(sdspi->file_lock_mtx = new_recursive_mutex())) {
                goto error;
        }

        if (!(sdspi->card_protect_mtx = new_mutex())) {
                goto error;
        }

        for (int i = 0; i < 4; i++) {
                sdspi->partition[i].file_lock_mtx = new_recursive_mutex();
                if (!sdspi->partition[i].file_lock_mtx)
                        goto error;
        }

        if (!(sdspi->gpio_file = fopen(SDSPI_GPIO_FILE, "r+"))) {
                goto error;
        }

        /* initialize SPI interface */
        if (turn_on_SPI_clock() != STD_RET_OK) {
                goto error;
        }

        enable_SS_output_in_master_mode();
        enable_unidirectional_data_mode();
        disable_hardware_CRC_calculation();
        enable_8_bit_data_frame();
        enable_software_slave_management();
        transmit_MSB_first();
        set_baud_rate(FPCLK_DIV_4);
        enable_master_mode();
        set_clock_polarity_to_0_when_idle();
        capture_on_first_edge();
        enable_SPI_peripheral();

