devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
        return STD_RET_OK;

error:
        if (sdspi) {
                if (sdspi->file_lock_mtx) {
                        delete_recursive_mutex(sdspi->file_lock_mtx);
                }

                if (sdspi->card_protect_mtx) {
                        delete_mutex(sdspi->card_protect_mtx);
                }

                for (int i = 0; i < 4; i++) {
                        if (sdspi->partition[i].file_lock_mtx) {
                                delete_recursive_mutex(sdspi->partition[i].file_lock_mtx);
                        }
                }

                if (sdspi->gpio_file) {
                        fclose(sdspi->gpio_file);
                }

                free(sdspi);
        }
        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in] *drvhdl           driver's memory handler
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t SDSPI_release(void *drvhdl)
{
        struct sdspi_data *hdl = drvhdl;

        if (!hdl) {
                return STD_RET_ERROR;
        }

        force_lock_recursive_mutex(hdl->file_lock_mtx);
        enter_critical();
        unlock_recursive_mutex(hdl->file_lock_mtx);
        delete_recursive_mutex(hdl->file_lock_mtx);
        delete_recursive_mutex(hdl->partition[0].file_lock_mtx);
        delete_recursive_mutex(hdl->partition[1].file_lock_mtx);
        delete_recursive_mutex(hdl->partition[2].file_lock_mtx);
        delete_recursive_mutex(hdl->partition[3].file_lock_mtx);
        delete_mutex(hdl->card_protect_mtx);
        fclose(hdl->gpio_file);
        turn_off_SPI_clock();
        free(hdl);
        exit_critical();

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Opens specified port
 *
 * @param[in] *drvhdl           driver's memory handler
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t SDSPI_open(void *drvhdl)
{
        struct sdspi_data *hdl = drvhdl;

        if (!hdl) {
                return STD_RET_ERROR;
        }

        if (lock_recursive_mutex(hdl->file_lock_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                return STD_RET_OK;
        } else {
                return STD_RET_ERROR;
        }
}

//==============================================================================
/**
 * @brief Function close opened port
 *
 * @param[in] *drvhdl           driver's memory handler
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t SDSPI_close(void *drvhdl)
{
        struct sdspi_data *hdl = drvhdl;

        if (!hdl) {
                return STD_RET_ERROR;
        }

        if (lock_recursive_mutex(hdl->file_lock_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                unlock_recursive_mutex(hdl->file_lock_mtx);     /* give this mutex */
                unlock_recursive_mutex(hdl->file_lock_mtx);     /* give mutex from open */
                return STD_RET_OK;
        } else {
                return STD_RET_ERROR;
        }
}

//==============================================================================
/**
 * @brief Write data
 *
 * @param[in] *drvhdl           driver's memory handle
 * @param[in] *src              source
 * @param[in]  size             item size
 * @param[in]  nitems           n-items to write
 * @param[in]  lseek            file index
 *
 * @retval number of written nitems
 */
//==============================================================================
size_t SDSPI_write(void *drvhdl, const void *src, size_t size, size_t nitems, u64_t lseek)
{
        struct sdspi_data *hdl = drvhdl;
        size_t n = 0;

        if (!hdl) {
                return 0;
        }

        if (lock_recursive_mutex(hdl->file_lock_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                if (lock_mutex(hdl->card_protect_mtx, MAX_DELAY) == MUTEX_LOCKED) {
                        n = card_write(hdl, src, size, nitems, lseek);
                        unlock_mutex(hdl->card_protect_mtx);
                }
                unlock_recursive_mutex(hdl->file_lock_mtx);
        }

        return n;
}

//==============================================================================
/**
 * @brief Read data (read 512 byte sector)
 *
 * @param[in]  *drvhdl          driver's memory handle
 * @param[out] *dst             destination
 * @param[in]   size            item size
 * @param[in]   nitems          n-items to read
 * @param[in]   lseek           file index
 *
 * @retval number of read nitems
 */
//==============================================================================
size_t SDSPI_read(void *drvhdl, void *dst, size_t size, size_t nitems, u64_t lseek)
{
        struct sdspi_data *hdl = drvhdl;
        size_t n = 0;

        if (!hdl) {
                return 0;
        }

        if (lock_recursive_mutex(hdl->file_lock_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                if (lock_mutex(hdl->card_protect_mtx, MAX_DELAY) == MUTEX_LOCKED) {
                        n = card_read(hdl, dst, size, nitems, lseek);
                        unlock_mutex(hdl->card_protect_mtx);
                }
                unlock_recursive_mutex(hdl->file_lock_mtx);
        }

        return n;
}

//==============================================================================
/**SDSPI_SPI
 * @brief Direct IO control
 *
 * @param[in]     *drvhdl       driver's memory handle
 * @param[in]     iorq          IO request
 * @param[in,out] args          additional arguments
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t SDSPI_ioctl(void *drvhdl, int iorq, va_list args)
{
        (void) args;

        struct sdspi_data *hdl = drvhdl;
        stdret_t status = STD_RET_OK;

        if (!hdl) {
                return STD_RET_ERROR;
        }

        if (lock_recursive_mutex(hdl->file_lock_mtx, MAX_DELAY) == MUTEX_LOCKED) {
                switch (iorq) {
                case SDSPI_IORQ_INITIALIZE_CARD:
                        if (lock_mutex(hdl->card_protect_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                                if (initialize_card(hdl) == STD_RET_OK) {
                                        if (detect_partitions(hdl) == STD_RET_OK) {
                                                /* success */
                                        }
                                }

