devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
                                unlock_mutex(hdl->card_protect_mtx);
                        } else {
                                status = STD_RET_ERROR;
                        }

                        break;

                default:
                        status = STD_RET_ERROR;
                        break;
                }

                unlock_recursive_mutex(hdl->file_lock_mtx);
        } else {
                return STD_RET_ERROR;
        }

        return status;
}

//==============================================================================
/**
 * @brief Function flush device
 *
 * @param[in] *drvhdl           driver's memory handle
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t SDSPI_flush(void *drvhdl)
{
        (void) drvhdl;

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function returns device informations
 *
 * @param[in]  *drvhld          driver's memory handle
 * @param[out] *info            device/file info
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t SDSPI_info(void *drvhdl, struct vfs_dev_info *info)
{
        struct sdspi_data *hdl = drvhdl;

        /* size info */
        if (send_cmd(hdl, CMD9, 0) == 0) {
                u8_t  csd[16];
                u8_t  token;
                uint  try = 1000000;

                while ((token = spi_rw(0xFF)) == 0xFF && --try);
                if (token != 0xFE)
                        return STD_RET_ERROR;

                u8_t *ptr = &csd[0];
                for (int i = 0; i < 4; i++) {
                        *ptr++ = spi_rw(0xFF);
                        *ptr++ = spi_rw(0xFF);
                        *ptr++ = spi_rw(0xFF);
                        *ptr++ = spi_rw(0xFF);
                }
                spi_rw(0xFF);
                spi_rw(0xFF);

                /* SDC version 2.00 */
                info->st_size = 0;
                if ((csd[0] >> 6) == 1) {
                        int csize     = csd[9] + ((u16_t)csd[8] << 8) + 1;
                        info->st_size = (u64_t)csize << 10;
                } else { /* SDC version 1.XX or MMC*/
                        int n     = (csd[5] & 15) + ((csd[10] & 128) >> 7) + ((csd[9] & 3) << 1) + 2;
                        int csize = (csd[8] >> 6) + ((u16_t)csd[7] << 2) + ((u16_t)(csd[6] & 3) << 10) + 1;
                        info->st_size = (u64_t)csize << (n - 9);
                }
                info->st_size *= SECTOR_SIZE;
        }

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function open new partiotion file
 *
 * @param[in] *drvhdl   handler to partition description
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_open(void *drvhdl)
{
        struct partition *hdl = drvhdl;

        if (!hdl) {
                return STD_RET_ERROR;
        }

        if (lock_recursive_mutex(hdl->file_lock_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                return STD_RET_OK;
        } else {
                return STD_RET_ERROR;
        }

        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Function close partition file
 *
 * @param[in] *drvhdl   handler to partition description
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_close(void *drvhdl)
{
        struct partition *hdl = drvhdl;

        if (!hdl) {
                return STD_RET_ERROR;
        }

        if (lock_recursive_mutex(hdl->file_lock_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                unlock_recursive_mutex(hdl->file_lock_mtx);     /* give this mutex */
                unlock_recursive_mutex(hdl->file_lock_mtx);     /* give mutex from open */
                return STD_RET_OK;
        } else {
                return STD_RET_ERROR;
        }
}

//==============================================================================
/**
 * @brief Function write data to partition file
 *
 * @param[in] *drvhdl           handler to partition description
 * @param[in] *src              source
 * @param[in]  size             item size
 * @param[in]  nitems           n-items to write
 * @param[in]  lseek            file index
 *
 * @retval number of written nitems
 */
//==============================================================================
static size_t partition_write(void *drvhdl, const void *src, size_t size, size_t nitems, u64_t lseek)
{
        struct partition *hdl = drvhdl;
        size_t n = 0;

        if (!hdl) {
                return 0;
        }

        if (lock_recursive_mutex(hdl->file_lock_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                if (lock_mutex(sdspi_data->card_protect_mtx, MAX_DELAY) == MUTEX_LOCKED) {
                        n = card_write(sdspi_data, src, size, nitems, lseek + (hdl->first_sector * SECTOR_SIZE));
                        unlock_mutex(sdspi_data->card_protect_mtx);
                }
                unlock_recursive_mutex(hdl->file_lock_mtx);
        }

        return n;
}

//==============================================================================
/**
 * @brief Function read data from partition file
 *
 * @param[in]  *drvhdl          handler to partition description
 * @param[out] *dst             destination
 * @param[in]   size            item size
 * @param[in]   nitems          n-items to read
 * @param[in]   lseek           file index
 *
 * @retval number of written nitems
 */
//==============================================================================
static size_t partition_read(void *drvhdl, void *dst, size_t size, size_t nitems, u64_t lseek)
{
        struct partition *hdl = drvhdl;
        size_t n = 0;

        if (!hdl) {
                return 0;
        }

        if (lock_recursive_mutex(hdl->file_lock_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                if (lock_mutex(sdspi_data->card_protect_mtx, MAX_DELAY) == MUTEX_LOCKED) {
                        n = card_read(sdspi_data, dst, size, nitems, lseek + (hdl->first_sector * SECTOR_SIZE));
                        unlock_mutex(sdspi_data->card_protect_mtx);
                }
                unlock_recursive_mutex(hdl->file_lock_mtx);
        }

        return n;
}

//==============================================================================
/**
 * @brief Function control partition
 *
 * @param[in]    *drvhdl        handler to partition description
 * @param[in]     iorq          IO request
 * @param[in,out] args          additional arguments
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_ioctl(void *drvhdl, int iorq, va_list args)
{
        (void) drvhdl;
        (void) iorq;
        (void) args;

        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Function flush partition
 *
 * @param[in] *drvhdl           handler to partition description
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_flush(void *drvhdl)
{
        (void) drvhdl;

