devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function returns device informations
 *
 * @param[in]  *drvhld          driver's memory handle
 * @param[out] *info            device/file info
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t partition_info(void *drvhdl, struct vfs_dev_info *info)
{
        struct partition *hdl = drvhdl;
        info->st_size = hdl->size_in_sectors * SECTOR_SIZE;
        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function turn on SPI clock
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t turn_on_SPI_clock(void)
{
        switch ((u32_t)SDSPI_PORT) {
        #if defined(RCC_APB2ENR_SPI1EN)
        case SPI1_BASE:
                RCC->APB2ENR |= RCC_APB2ENR_SPI1EN;
                return STD_RET_OK;
        #endif
        #if defined(RCC_APB1ENR_SPI2EN)
        case SPI2_BASE:
                RCC->APB1ENR |= RCC_APB1ENR_SPI2EN;
                return STD_RET_OK;
        #endif
        #if defined(RCC_APB1ENR_SPI3EN)
        case SPI3_BASE:
                RCC->APB1ENR |= RCC_APB1ENR_SPI3EN;
                return STD_RET_OK;
        #endif
        default:
                return STD_RET_ERROR;
        }
}

//==============================================================================
/**
 * @brief Function turn off SPI clock
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t turn_off_SPI_clock(void)
{
        switch ((u32_t)SDSPI_PORT) {
        #if defined(RCC_APB2ENR_SPI1EN)
        case SPI1_BASE:
                RCC->APB2RSTR |=  RCC_APB2RSTR_SPI1RST;
                RCC->APB2RSTR &= ~RCC_APB2RSTR_SPI1RST;
                RCC->APB2ENR  &= ~RCC_APB2ENR_SPI1EN;
                return STD_RET_OK;
        #endif
        #if defined(RCC_APB1ENR_SPI2EN)
        case SPI2_BASE:
                RCC->APB1RSTR |=  RCC_APB1RSTR_SPI2RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI2RST;
                RCC->APB1ENR  &= ~RCC_APB1ENR_SPI2EN;
                return STD_RET_OK;
        #endif
        #if defined(RCC_APB1ENR_SPI3EN)
        case SPI3_BASE:
                RCC->APB1RSTR |=  RCC_APB1RSTR_SPI3RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI3RST;
                RCC->APB1ENR  &= ~RCC_APB1ENR_SPI3EN;
                return STD_RET_OK;
        #endif
        default:
                return STD_RET_ERROR;
        }
}

//==============================================================================
/**
 * @brief Function send byte by SPI peripheral
 *
 * @param[in] out       data to send
 *
 * @return received byte
 */
//==============================================================================
static u8_t spi_rw(u8_t out)
{
        send_data(out);
        while (!is_Rx_buffer_not_empty());
        return get_data();
}

//==============================================================================
/**
 * @brief Function wait for card ready
 *
 * @return card response
 */
//==============================================================================
static u8_t wait_ready(void)
{
        int  try = 1000000;
        u8_t response;

        spi_rw(0xFF);

        while ((response = spi_rw(0xFF)) != 0xFF && --try);

        return response;
}

//==============================================================================
/**
 * @brief Function transmit command to card
 *
 * @param[in] *sdspi    SD SPI interface data
 * @param[in] cmd       card command
 * @param[in] arg       command's argument
 */
//==============================================================================
static u8_t send_cmd(struct sdspi_data *sdspi, u8_t cmd, u32_t arg)
{
        u8_t response;

        /* ACMD<n> is the command sequence of CMD55-CMD<n> */
        if (cmd & 0x80) {
                cmd &= 0x7F;
                response = send_cmd(sdspi, CMD55, 0);
                if (response > 1)
                        return response;
        }

        /* select the card and wait for ready */
        ioctl(sdspi->gpio_file, GPIO_IORQ_SD_DESELECT);
        ioctl(sdspi->gpio_file, GPIO_IORQ_SD_SELECT);

        if (wait_ready() != 0xFF) {
                return 0xFF;
        }

        /* send command packet */
        spi_rw(cmd);                    /* Start + Command index */
        spi_rw(arg >> 24);              /* Argument[31..24]      */
        spi_rw(arg >> 16);              /* Argument[23..16]      */
        spi_rw(arg >> 8);               /* Argument[15..8]       */
        spi_rw(arg);

        if (cmd == CMD0)
                spi_rw(0x95);           /* Valid CRC for CMD0(0) */
        else if (cmd == CMD8)
                spi_rw(0x87);           /* Valid CRC for CMD8(0x1AA) */
        else
                spi_rw(0x01);           /* Dummy CRC + Stop */

        /* receive command response */
        if (cmd == CMD12)
                spi_rw(0xFF);           /* Skip a stuff byte when stop reading */

        /* wait for a valid response in timeout of 10 attempts */
        int n = 10;
        do {
                response = spi_rw(0xFF);
        } while ((response & 0x80) && --n);

        return response;
}

//==============================================================================
/**
 * @brief Function receive data block
 *
 * @param[out] *buff            data buffer (sector size)
 *
 * @retval true if success
 * @retval false if error
 */
//==============================================================================
static bool receive_data_block(u8_t *buff)
{
        u8_t token;
        uint try = 1000000;

        while ((token = spi_rw(0xFF)) == 0xFF && --try);

        if (token != 0xFE)
                return false;

#if (SDSPI_ENABLE_DMA != 0)
        SDSPI_DMA_RX_CHANNEL->CPAR  = (u32_t)&SDSPI_PORT->DR;
        SDSPI_DMA_RX_CHANNEL->CMAR  = (u32_t)buff;
        SDSPI_DMA_RX_CHANNEL->CNDTR = SECTOR_SIZE;
        SDSPI_DMA_RX_CHANNEL->CCR   = DMA_CCR1_MINC | DMA_CCR1_TCIE | DMA_CCR1_EN;
        NVIC_EnableIRQ(SDSPI_DMA_IRQ);

        u16_t dummy = 0xFFFF;
        SDSPI_DMA_TX_CHANNEL->CPAR  = (u32_t)&SDSPI_PORT->DR;
        SDSPI_DMA_TX_CHANNEL->CMAR  = (u32_t)&dummy;
        SDSPI_DMA_TX_CHANNEL->CNDTR = SECTOR_SIZE;
        SDSPI_DMA_TX_CHANNEL->CCR   = DMA_CCR1_DIR | DMA_CCR1_EN;

        enable_Tx_DMA();
        enable_Rx_DMA();

        sdspi_data->DMA_host_task = get_task_handle();
        suspend_this_task();
#else
        /* memory alignment */
        int size = SECTOR_SIZE;
        do {
                *buff++ = spi_rw(0xFF);
                *buff++ = spi_rw(0xFF);
                *buff++ = spi_rw(0xFF);
                *buff++ = spi_rw(0xFF);
        } while (size -= 4);
#endif

        /* discard CRC */
        spi_rw(0xFF);
        spi_rw(0xFF);

