devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
        return true;
}

//==============================================================================
/**
 * @brief Function transmit data block
 *
 * @param[in] *buff             source buffer (sector size)
 * @param[in]  toke             token to send
 *
 * @retval true if success
 * @retval false if error
 */
//==============================================================================
static bool transmit_data_block(const u8_t *buff, u8_t token)
{
        if (wait_ready() != 0xFF)
                return false;

        spi_rw(token);

        if (token != 0xFD) {
#if (SDSPI_ENABLE_DMA != 0)
                u16_t dummy;
                SDSPI_DMA_RX_CHANNEL->CMAR  = (u32_t)&dummy;
                SDSPI_DMA_RX_CHANNEL->CPAR  = (u32_t)&SDSPI_PORT->DR;
                SDSPI_DMA_RX_CHANNEL->CNDTR = SECTOR_SIZE;
                SDSPI_DMA_RX_CHANNEL->CCR   = DMA_CCR1_TCIE | DMA_CCR1_EN;
                NVIC_EnableIRQ(SDSPI_DMA_IRQ);

                SDSPI_DMA_TX_CHANNEL->CMAR  = (u32_t)buff;
                SDSPI_DMA_TX_CHANNEL->CPAR  = (u32_t)&SDSPI_PORT->DR;
                SDSPI_DMA_TX_CHANNEL->CNDTR = SECTOR_SIZE;
                SDSPI_DMA_TX_CHANNEL->CCR   = DMA_CCR1_MINC | DMA_CCR1_DIR | DMA_CCR1_EN;

                enable_Tx_DMA();
                enable_Rx_DMA();

                sdspi_data->DMA_host_task = get_task_handle();
                suspend_this_task();
#else
                int size = SECTOR_SIZE;
                do {
                        spi_rw(*buff++);
                        spi_rw(*buff++);
                        spi_rw(*buff++);
                        spi_rw(*buff++);
                } while (size -= 4);
#endif

                /* CRC dummy */
                spi_rw(0xFF);
                spi_rw(0xFF);

                /* receive data response */
                if ((spi_rw(0xFF) & 0x1F) != 0x05)
                        return false;
        }

        return true;
}

//==============================================================================
/**
 * @brief Function read whole sectors
 *
 * @param[in]  *hdl             driver's memory handle
 * @param[out] *dst             destination
 * @param[in]   nsectors        sectors to read
 * @param[in]   lseek           file index
 *
 * @retval number of read sectors
 */
//==============================================================================
static size_t read_whole_sectors(struct sdspi_data *hdl, void *dst, size_t nsectors, u64_t lseek)
{
        size_t n = 0;

        if (hdl->card_type & CT_BLOCK) {
                lseek >>= 9;    /* divide by 512 */
        }

        /* 1 sector to read */
        if (nsectors == 1) {
                if (send_cmd(hdl, CMD17, (u32_t)lseek) == 0) {
                        if (receive_data_block(dst)) {
                                n = 1;
                        }
                }
        } else {
                if (send_cmd(hdl, CMD18, (u32_t)lseek) == 0) {
                        do {
                                if (!receive_data_block(dst)) {
                                        break;
                                }

                                dst += SECTOR_SIZE;
                        } while (++n < nsectors);

                        /* stop transmission */
                        send_cmd(hdl, CMD12, 0);
                }
        }

        return n;
}

//==============================================================================
/**
 * @brief Function read only selected data from sectors
 *
 * @param[in]  *hdl             driver's memory handle
 * @param[out] *dst             destination
 * @param[in]   size            number of bytes to read
 * @param[in]   lseek           file index
 *
 * @retval number of read bytes
 */
//==============================================================================
static size_t read_partial_sectors(struct sdspi_data *hdl, void *dst, size_t size, u64_t lseek)
{
        u8_t *buffer = malloc(SECTOR_SIZE);
        if (!buffer)
                return 0;

        u32_t recv_data  = 0;
        while (recv_data < size) {
                if (lseek % SECTOR_SIZE == 0 && (size - recv_data) / SECTOR_SIZE > 0) {
                        size_t n = read_whole_sectors(hdl, dst, size / SECTOR_SIZE, lseek);
                        if (n != size / SECTOR_SIZE)
                                break;

                        dst       += n * SECTOR_SIZE;
                        lseek     += n * SECTOR_SIZE;
                        recv_data += n * SECTOR_SIZE;
                } else {
                        if (read_whole_sectors(hdl, buffer, 1, lseek & ~(0x1FF)) != 1)
                                break;

                        u32_t rest;
                        if ((SECTOR_SIZE - (lseek % SECTOR_SIZE)) > (size - recv_data))
                                rest = size - recv_data;
                        else
                                rest = SECTOR_SIZE - (lseek % SECTOR_SIZE);

                        memcpy(dst, buffer + (lseek % SECTOR_SIZE), rest);
                        dst       += rest;
                        recv_data += rest;
                        lseek     += rest;
                }
        }

        free(buffer);

        return recv_data;
}

//==============================================================================
/**
 * @brief Function write whole sectors
 *
 * @param[in]  *hdl             driver's memory handle
 * @param[out] *src             source
 * @param[in]   nsectors        sectors to read
 * @param[in]   lseek           file index
 *
 * @retval number of written sectors
 */
//==============================================================================
static size_t write_whole_sectors(struct sdspi_data *hdl, const void *src, size_t nsectors, u64_t lseek)
{
        size_t n = 0;

        if (hdl->card_type & CT_BLOCK) {
                lseek >>= 9;    /* divide by 512 */
        }

        /* 1 sector to read */
        if (nsectors == 1) {
                if (send_cmd(hdl, CMD24, (u32_t)lseek) == 0) {
                        if (transmit_data_block(src, 0xFE)) {
                                n = 1;
                        }
                }
        } else {
                if (hdl->card_type & CT_SDC) {
                        send_cmd(hdl, ACMD23, nsectors);
                }

                if (send_cmd(hdl, CMD25, (u32_t)lseek) == 0) {
                        do {
                                if (!transmit_data_block(src, 0xFC)) {
                                        break;
                                }

                                src += SECTOR_SIZE;
                        } while (++n < nsectors);

                        /* stop transmission */
                        if (!transmit_data_block(NULL, 0xFD)) {
                                n = 0;
                        }
                }
        }

        return n;
}

//==============================================================================
/**
 * @brief Function write only selected data to sectors
 *
 * @param[in]  *hdl             driver's memory handle
 * @param[out] *src             source
 * @param[in]   size            number of bytes to read
 * @param[in]   lseek           file index
 *
 * @retval number of written bytes
 */
//==============================================================================
static size_t write_partial_sectors(struct sdspi_data *hdl, const void *src, size_t size, u64_t lseek)
{
        u8_t *buffer = malloc(SECTOR_SIZE);
        if (!buffer)
                return 0;

        u32_t transmit_data = 0;
        while (transmit_data < size) {
                if (lseek % SECTOR_SIZE == 0 && (size - transmit_data) / SECTOR_SIZE > 0) {
                        size_t n = write_whole_sectors(hdl, src, size / SECTOR_SIZE, lseek);
                        if (n != size / SECTOR_SIZE)
                                break;

                        src           += n * SECTOR_SIZE;
                        lseek         += n * SECTOR_SIZE;
                        transmit_data += n * SECTOR_SIZE;
                } else {
                        if (read_whole_sectors(hdl, buffer, 1, lseek & ~(0x1FF)) != 1)
                                break;

                        u32_t rest;
                        if ((SECTOR_SIZE - (lseek % SECTOR_SIZE)) > (size - transmit_data))
                                rest = size - transmit_data;
                        else
                                rest = SECTOR_SIZE - (lseek % SECTOR_SIZE);

                        memcpy(buffer + (lseek % SECTOR_SIZE), src, rest);

                        if (write_whole_sectors(hdl, buffer, 1, lseek & ~(0x1FF)) != 1)
                                break;

                        src           += rest;
                        transmit_data += rest;
                        lseek         += rest;
                }
        }

        free(buffer);

        return transmit_data;
}

//==============================================================================
/**
 * @brief Function initialize card
 *
 * @param[in] *hdl      SD module data
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t initialize_card(struct sdspi_data *hdl)
{
#include "core/io.h" /* FIXME -- niepotrzebne */
        ioctl(hdl->gpio_file, GPIO_IORQ_SD_DESELECT);
        for (int n = 0; n < 10; n++) {
                spi_rw(0xFF);
        }

        int  timeout = 2 * SDSPI_WAIT_TIMEOUT;
        u8_t cmd;
        u8_t OCR[4];

        hdl->card_type = 0;
        hdl->card_initialized = false;

        if (send_cmd(hdl, CMD0, 0) == 0x01) {
                if (send_cmd(hdl, CMD8, 0x1AA) == 0x01) { /* check SDHC card */
                        for (int n = 0; n < 4; n++) {
                                OCR[n] = spi_rw(0xFF);
                        }

                        if (OCR[2] == 0x01 && OCR[3] == 0xAA) {
                                while (--timeout && send_cmd(hdl, ACMD41, 1UL << 30)) {
                                        sleep_ms(1);
                                }

                                if (timeout && send_cmd(hdl, CMD58, 0) == 0) {
                                        for (int n = 0; n < 4; n++) {
                                                OCR[n] = spi_rw(0xFF);
                                        }

                                        hdl->card_type = (OCR[0] & 0x40) ? CT_SD2 | CT_BLOCK : CT_SD2;
                                }
                        }
                } else { /* SDSC or MMC */
                        if (send_cmd(hdl, ACMD41, 0) <= 0x01)   {
                                hdl->card_type = CT_SD1;
                                cmd = ACMD41;   /* SDSC */
                        } else {
                                hdl->card_type = CT_MMC;
                                cmd = CMD1;     /* MMC */
                        }

                        /* Wait for leaving idle state */
                        while (timeout && send_cmd(hdl, cmd, 0)) {
                                timeout--;
                                sleep_ms(1);
                        }

