devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
                        /* set R/W block length to 512 */
                        if (!timeout || send_cmd(hdl, CMD16, SECTOR_SIZE) != 0) {
                                hdl->card_type = 0;
                        }
                }

                if (timeout) {
                        hdl->card_initialized = true;
                }
        }

        ioctl(hdl->gpio_file, GPIO_IORQ_SD_DESELECT);
        spi_rw(0xFF);

        if (hdl->card_initialized == false) {
                printk(FONT_COLOR_RED"Card not initialized...\n"RESET_ATTRIBUTES);
                return STD_RET_ERROR;
        } else {
                printk("Card initialized. Card type: 0x%x\n", hdl->card_type);
                return STD_RET_OK;
        }
}

//==============================================================================
/**
 * @brief Function detect partitions
 *
 * @param[in] *hdl      SD module data
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t detect_partitions(struct sdspi_data *hdl)
{
        stdret_t status = STD_RET_ERROR;

        u8_t *MBR = malloc(SECTOR_SIZE);

        if (MBR) {
                if (card_read(hdl, MBR, SECTOR_SIZE, 1, 0) != 1) {
                        goto error;
                }

                if (MBR_GET_BOOT_SIGNATURE(MBR) != 0xAA55) {
                        goto error;
                }

                struct vfs_drv_interface drvif;
                drvif.drv_open  = partition_open;
                drvif.drv_close = partition_close;
                drvif.drv_write = partition_write;
                drvif.drv_read  = partition_read;
                drvif.drv_ioctl = partition_ioctl;
                drvif.drv_flush = partition_flush;
                drvif.drv_info  = partition_info;

                if (MBR_GET_PARTITION_1_NUMBER_OF_SECTORS(MBR) > 0) {
                        hdl->partition[0].first_sector    = MBR_GET_PARTITION_1_LBA_FIRST_SECTOR(MBR);
                        hdl->partition[0].size_in_sectors = MBR_GET_PARTITION_1_NUMBER_OF_SECTORS(MBR);
                        drvif.handle                      = &hdl->partition[0];
                        mknod(SDSPI_PARTITION_1_PATH, &drvif);
                }

                if (MBR_GET_PARTITION_2_NUMBER_OF_SECTORS(MBR) > 0) {
                        hdl->partition[1].first_sector    = MBR_GET_PARTITION_2_LBA_FIRST_SECTOR(MBR);
                        hdl->partition[1].size_in_sectors = MBR_GET_PARTITION_2_NUMBER_OF_SECTORS(MBR);
                        drvif.handle                      = &hdl->partition[1];
                        mknod(SDSPI_PARTITION_2_PATH, &drvif);
                }

                if (MBR_GET_PARTITION_3_NUMBER_OF_SECTORS(MBR) > 0) {
                        hdl->partition[2].first_sector    = MBR_GET_PARTITION_3_LBA_FIRST_SECTOR(MBR);
                        hdl->partition[2].size_in_sectors = MBR_GET_PARTITION_3_NUMBER_OF_SECTORS(MBR);
                        drvif.handle                      = &hdl->partition[2];
                        mknod(SDSPI_PARTITION_3_PATH, &drvif);
                }

                if (MBR_GET_PARTITION_4_NUMBER_OF_SECTORS(MBR) > 0) {
                        hdl->partition[3].first_sector    = MBR_GET_PARTITION_4_LBA_FIRST_SECTOR(MBR);
                        hdl->partition[3].size_in_sectors = MBR_GET_PARTITION_4_NUMBER_OF_SECTORS(MBR);
                        drvif.handle                      = &hdl->partition[3];
                        mknod(SDSPI_PARTITION_4_PATH, &drvif);
                }

                status = STD_RET_OK;
error:
                free(MBR);
        }

        return status;
}

//==============================================================================
/**
 * @brief Read data from card
 *
 * @param[in]  *hdl             driver's memory handle
 * @param[out] *dst             destination
 * @param[in]   size            item size
 * @param[in]   nitems          n-items to read
 * @param[in]   lseek           file index
 *
 * @retval number of read nitems
 */
//==============================================================================
static size_t card_read(struct sdspi_data *hdl, void *dst, size_t size, size_t nitems, u64_t lseek)
{
        size_t n = 0;

        if (hdl->card_initialized == false) {
                return 0;
        }

        /* whole sector(s) read */
        if (((size * nitems) % SECTOR_SIZE == 0) && (lseek % SECTOR_SIZE == 0)) {

                n  = read_whole_sectors(hdl, dst, (size * nitems) / SECTOR_SIZE, lseek);
                n *= SECTOR_SIZE / size;

        } else {
                n  = read_partial_sectors(hdl, dst, size * nitems, lseek);
                n /= size;
        }

        ioctl(hdl->gpio_file, GPIO_IORQ_SD_DESELECT);
        spi_rw(0xFF);
        return n;
}

//==============================================================================
/**
 * @brief Write data to card
 *
 * @param[in] *hdl              driver's memory handle
 * @param[in] *src              source
 * @param[in]  size             item size
 * @param[in]  nitems           n-items to write
 * @param[in]  lseek            file index
 *
 * @retval number of written nitems
 */
//==============================================================================
static size_t card_write(struct sdspi_data *hdl, const void *src, size_t size, size_t nitems, u64_t lseek)
{
        size_t n = 0;

        if (hdl->card_initialized == false) {
                return 0;
        }

        /* whole sector(s) read */
        if (((size * nitems) % SECTOR_SIZE == 0) && (lseek % SECTOR_SIZE == 0)) {

                n  = write_whole_sectors(hdl, src, (size * nitems) / SECTOR_SIZE, lseek);
                n *= SECTOR_SIZE / size;

        } else {
                n  = write_partial_sectors(hdl, src, size * nitems, lseek);
                n /= size;
        }

        ioctl(hdl->gpio_file, GPIO_IORQ_SD_DESELECT);
        spi_rw(0xFF);
        return n;
}

//==============================================================================
/**
 * @brief DMA operation finish interrupt
 */
//==============================================================================
#if (SDSPI_ENABLE_DMA != 0)
void SDSPI_DMA_ISR(void)
{
        disable_Rx_DMA();
        disable_Tx_DMA();

        SDSPI_DMA_RX_CHANNEL->CCR = 0x00;
        SDSPI_DMA_TX_CHANNEL->CCR = 0x00;

        NVIC_DisableIRQ(SDSPI_DMA_IRQ);

        SDSPI_DMA->IFCR = DMA_IFCR_CTCIF1 << (4 * (SDSPI_DMA_RX_CHANNEL_NO - 1));

        if (resume_task_from_ISR(sdspi_data->DMA_host_task) == pdTRUE) {
                yield_task();
        }
}
#endif

#ifdef __cplusplus
}
#endif

/*==============================================================================
  End of file
==============================================================================*/
